"""На вход программе подается текст. Выведите слово (в нижнем регистре), которое встречается в тексте чаще всего,
и количество его появлений через пробел. Гарантируется, что из знаков препинания встречаются только символы
{",", ".", "?", "!"}, а также то, что в тексте есть только одно слово с наибольшей частотой появлений."""

# text = input()
text = "Корабли лавировали, лавировали, да не вылавировали"
text = text.lower()
print(text)