s ="Посоветуй мне книгу (Maria)" # преобразовать в список , где имя в скобках и фраза разные строки
lybr = {'Булгаков "Собачье сердце"': 'сатира', 'Толкин "Властелин колец"': 'фэнтези', 'Дойл "Затерянный мир"': 'научная фантастика', 'Кристи "Десять негритят"': 'детектив', 'Кинг "Сияние"': 'ужасы', 'Дойл "Отравленный пояс"': 'научная фантастика', 'Лавкрафт "Зов Ктулху"': 'ужасы', 'Лутц "Изучаем Python"': 'учебная литература', 'Рао "C++ за 21 день"': 'ужасы', 'Толкин "Хоббит"': 'фэнтези', 'Дойл "Долина ужаса"': 'детектив', 'Кинг "Оно"': 'ужасы', 'Кристи "Убийство в доме викария"': 'детектив', 'Кинг "Противостояние"': 'ужасы', 'Вейер "Марсианин"': 'научная фантастика'}

dict = {'Dontsova': ['Десять негритят', 'Долина ужаса'], 'Jerry': ['Зов Ктулху', 'Противостояние', 'Затерянный мир', 'Отравленный пояс'], 'Maria': ['Хоббит', 'Властелин колец']}
s = s.split(" (")
print(s[1][:-1])
s[1] = s[1][:-1]
# print(s)
# print(s[1])
print(dict[s[1]])
# fav = [ lybr[x] for x in dict[s[1]]]
# print(fav)



# dict={}
# # b = 'Dontsova "Десять негритят"'
# b = input()
# b  = b.split(' "')
# b[1] = b[1][:-1]
# dict.setdefault(b[0],[])
# dict[b[0]].append(b[1])
# print(dict[b[0]])
#
#
# print(dict)




# book =  input().split(", ")
# lybr = {x: book[x] for x in range(len(book))}
# print(lybr)
# print(len(lybr[0]))
# print(book)
# lybr = {}
# for x in range(len(book)):
#
#     book[x] = book[x].split(' (')
#     book[x][1] = book[x][1][:-1]
#     lybr.update([book[x]])
# print(lybr)
