# n = int(input())
n = 5
# count = n//25 + n%25//10 + n%25%10//5 + n%25%10%5//1
# print("Количество четвертаков для размена -", n//25,"После размена осталось -" , n%25)  # использовали 1 четввертак
# print("Количество 10 для размена остатка -", n%25//10,"После размена осталось -" , n%25%10)
# print("Количество 5 для размена остатка -", n%25%10//5,"После размена осталось -" , n%25%10%5)
# print("Количество 1 для размена остатка -", n%25%10%5//1,"После размена осталось -" , n%25%10%5%1)
# print(count)
count = 0
while n >= 25:
    n -= 25
    count += 1
while n >= 10  :
    n -= 10
    count += 1
while n >= 5  :
    n -= 5
    count += 1
while n > 0 :
    n -= 1
    count += 1
print(count)

